num1 = int(input("please enter first number: "))
num2 = int(input("please enter second number: "))
num3 = int(input("please enter third number: "))
num4 = int(input("please enter fourth number: "))


print(num1 + num2 + num3 + num4)
print(num1 - num2 - num3 - num4)
print(num1 * num2 * num3 * num4)
print(num1 / num2 / num3 / num4)


#პირველ კოდში ვთხოვთ რომ შემოიტანოს პირველი ციფრი, იგივეს ვაკეთებთ 2-ე, 3-ე და 4-ე ხაზებში.
#7-ე ხანში ვპრინტავთ და ვაკეთებთ არითმეტიკულ მოქმედებას მიმატებას,8-ე ხაზში გამოკლებას, 9-ე ხაზში გამრავლებას და 10-ე ხაზში გაყოფას.
#პირველ ოთხ ხაზში ჩვენ ვთხოვთ შემოიტანონ რიცხვები და შემდეგ პრინტის საშუალებით ამ რიცხვების არითმეტიკული მოქმედები ხდება.
#input - ეს არის პითონის შეყვანის ფუნქცია, რა დროსაც ჩვენ ვთხოვთ მომხმარებელს შეიყვანოს ინფორმაცია, ამ დროს პროგრამა ელოდება მომხმარებლის მიერ მონაცემის ჩასმას.
#output - ჩვენ ვიყენებთ პრინტის ფუნქციას, როდესაც გვინდა რომ ჩვენს მიერ დაწერილი კოდი გამოიტანოს, ანუ ჩვენ თუ გვინდა რომ ჩვენს მიერ დაწერილმა კოდმა გააკეთოს output, ამ კოდს დავწერთ(print-ში)რის შედეგადაც პრინტ მას დაბეჭდავს